results/choreographer.txt
Running 10s test @ http://127.0.0.1:2048/product/foo
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   455.59us  419.44us  14.53ms   98.72%
    Req/Sec    11.60k     1.19k   12.36k    95.00%
  92341 requests in 4.00s, 12.06MB read
  Socket errors: connect 0, read 9, write 0, timeout 0
Requests/sec:  23084.46
Transfer/sec:      3.02MB